Revit 2026 API

# TextBaselineStyle Enumeration

---

Supported styles of text position relative to the normal baseline.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TextBaselineStyle
```
```vb
Public Enumeration TextBaselineStyle
```
```cpp
public enum class TextBaselineStyle
```
```fsharp
type TextBaselineStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Normal | 0 | Indicates a normal text with letters positioned on the baseline. |
| Subscript | 1 | Indicates a subsript text. |
| Superscript | 2 | Indicates a superscript text. |

#### Reference

Autodesk.Revit.DB Namespace